#include <iostream>
#include <string>
#include <vector>
#include <clocale>
using namespace std;

int sum(string);

int main() {
    string cinema[] = {"Поймай меня, если сможешь", "Игра в иммитацию", "Афера Томаса Крауна", "Игра на понижение", 
                        "Начало", "Лёгкое поведение", "Окно во двор", "Римские каникулы",
                        "Моя прекрасная леди", "Завтрак у Тиффани", "Ва-банк", "11 друзей Оушена", 
                        "Иллюзия обмана", "Игры разума", "Гордость и предубеждение", "Достать ножи",
                        "Интерстеллар", "Пианист", "Отель Гранд Будапешт", "Амели",
                        "Шерлок", "Убийство в восточном экспрессе", "1+1", "В бой идут одни старики", 
                        "Ошибка резидента", "Собачье сердце", "Место встречи изменить нельзя", "Офицеры"};
    string vip[] = {"Киану Ривз", "Тимоти Шаламэ", "Рианна", "Лана Дель Рей",
                    "Квентин Тарантино", "Джеки Чан", "Ариана Гранде", "Бред Питт", 
                    "Принц Гарри", "Мартин Скорсезе", "Людовико Эйнауди", "Линдси Стирлинг", 
                    "Дэвид Гаррет", "Денис Мацуев", "Харуки Мураками", "Пауло Коэльо", 
                    "Райан Рейнолдс", "Кира Найтли", "Колин Ферт", "Уоррен Баффетт",
                    "Криштиану Роналду", "Дэвид Бэкхэм", "Дэн Браун", "Джефф Безос",
                    "Леди Гага", "Зендея", "Бенедикт Кэмбербэтч", "Роберт Дауни-младший"};
    string music[] = {"Bon Jovi - My life", "Zaz - Je veux", "Enrique Iglesias - Bailando", 
                        "Camila Cabello - Seniorita", "Scorpions - Wind of Change", "Maneskin - ZITTI E BUONI",
                        "Indila - Dernière Danse", "Ray Charles - Hit The Road Jack", "Scorpions - Still Loving You"};
    string name, surname, birth;
    cout << "Привет, у нас есть немного развлекательного контента для вас. Хотите пройти тест? Тогда введите ваше имя, фамилию и год рождения." << endl;
    cout << "Имя: ";
    cin >> name;
    cout << "Фамилия: ";
    cin >> surname;
    cout << "Год рождения: ";
    cin >> birth;
    string n, s, alf_rus = "АБВГДЕЖЗИКЛМНОПРСТУФХЦЧШЩЭЮЯ";
    n.append(name, 0, 2);
    s.append(surname, 0, 2);
    n = cinema[alf_rus.find(n) / 2];
    s = vip[alf_rus.find(s) / 2];
    cout << "Супер! Ваш фильм - это <<" << n << ">>, звезда - " << s << ". Музыкальная композиция для вас: " << music[sum(birth)] << endl; 
}

int sum(string s) {
    int n=0, len = s.length();
    string a[len];
    for (int i=0; i < len; i++) {
        a[i].append(s, i, 1);
        n += stoi(a[i]);
    }
    if (n/10 == 0) return n;
    else return sum(to_string(n));
}